package 조건6_문제_종합응용;

import java.util.Random;

public class 조건문6_문제10_자리수합최대값_문제 {

	public static void main(String[] args) {
	    /*
	        [문제]
	            [1] 랜덤(10~99)숫자 3개를 저장한다.
	            [2] 각각의 숫자의 자리수의 합을 구한다.
	            [3] 자리수의 합이 가장큰수를 출력한다.
	            
	        [예시]
	            11 18 32 
	        [설명] 
	            1 , 1 의합은 2  
	            1 , 8 의합은 9 
	            3 , 2 안합은 5 
	            세값중에서 9가 가장크다. 여기서 9를 출력하면안되고 18을 출력한다.
	        
	            [정답]
	            18
	    */
		
	}

}
