package 조건3_문제_추가계산;

import java.util.Random;

public class 조건문3_문제02_할인두개_문제 {

	public static void main(String[] args) {
	    /*
	        [문제]
	            철수는 마트에 갔더니, 오렌지가 한개에 1000원
	            사과가 한개에 800원에 팔고있다. 
	            단, 마트에서는 오렌지 와 사과 합쳐서 10개 이상구입하면,
	            각각 100원씩 할일해주는 행사를 하고있다. 
	            
	            철수는 
	            랜덤(1~10)개수 만큼 오렌지 구입하였고,
	            랜덤(1~10)개수 만큼 사과를 구입하였다.
	
	            철수가 구입한 오렌지와 사과의 개수와 구입가격을 출력하시오.
	        [예시]
	            오렌지 : 2
	            사과 : 8
	            구입가격 : 1800 + 5600 = 7400
	
	    */
	
	}

}
